app/controllers/comments_controller.rb

  def new
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def show
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    # authorize @comment
    if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("author", "content", "post_id") VALUES ($1, $2, $3) RETURNING "id"  [["author", "Jim"], ["content", "yayayaya"], ["post_id", 1]]

  def destroy
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    # authorize @comment
    @comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]