app/controllers/home_controller.rb

  def index
    @references = Reference.all
---
SELECT "references".* FROM "references"