app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    @comments = @post.comments.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

  def create
    @post = Post.new(post_params)
    authorize @post
    if @post.save
---
INSERT INTO "posts" ("name", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Look at this"], ["content", "It's full of stuff"], ["created_at", "2015-07-17 18:16:52.192966"], ["updated_at", "2015-07-17 18:16:52.192966"]]