app/controllers/projects_controller.rb

UPDATE "projects" SET "title" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["title", "nonrandom title"], ["updated_at", "2015-07-10 18:12:48.805388"], ["id", 3]]
---
  def update
    @skill = Skill.find(params[:skill_id])
    @project = Project.find(params[:id])
    # authorize @project
    if @project.update(project_params)

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 2]]
---
  def destroy
    @skill = Skill.find(params[:skill_id])
    @project = Project.find(params[:id])
    # authorize @project
    @project.destroy