app/controllers/projects_controller.rb

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @skill = Skill.find(params[:skill_id])

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @skill = Skill.find(params[:skill_id])
    @project = Project.find(params[:id])

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "projects" ("title", "description", "url", "skill_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @skill = Skill.find(params[:skill_id])
    @project = @skill.projects.new(project_params)
    # authorize @project
    if @project.save

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @skill = Skill.find(params[:skill_id])
    @project = Project.find(params[:id])

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "projects" SET "description" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["description", "A fight to the death with the leader of The Hand, over supremacy over the ancient ninja clan."], ["updated_at", "2015-07-21 16:40:19.209987"], ["id", 2]]
---
  def update
    @skill = Skill.find(params[:skill_id])
    @project = Project.find(params[:id])
    # authorize @project
    if @project.update(project_params)