app/controllers/references_controller.rb

   def show
     @reference = Reference.find(params[:id])
---
SELECT  "references".* FROM "references" WHERE "references"."id" = $1 LIMIT 1  [["id", 6]]

   def create
     @reference = Reference.new(reference_params)
     if @reference.save
---
INSERT INTO "references" ("name", "company", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Joe"], ["company", "Stylin"], ["email", "joe@joe.com"], ["phone", "123-456-7890"], ["created_at", "2015-07-17 22:11:56.203992"], ["updated_at", "2015-07-17 22:11:56.203992"]]