app/controllers/skills_controller.rb

  def index
    @skills = Skill.all
---
SELECT "skills".* FROM "skills"

  def show
    @skill = Skill.find(params[:id])
    @projects = @skill.projects.all
---
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."skill_id" = $1  [["skill_id", 1]]

  def create
    @skill = Skill.new(skill_params)
    # authorize @skill
    if @skill.save
---
INSERT INTO "skills" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Hunting"], ["description", "this will promptly be deleted"], ["created_at", "2015-07-10 22:16:08.792444"], ["updated_at", "2015-07-10 22:16:08.792444"]]

  def edit
    @skill = Skill.find(params[:id])
---
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 1]]

  def destroy
    @skill = Skill.find(params[:id])
    # authorize @skill
    @skill.destroy
---
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "skills" WHERE "skills"."id" = $1  [["id", 2]]